:PROPERTIES:
:ID:       abf8ed8e-5b38-4538-8828-6fa065b9e5d6
:END:
#+title: python

*** List Comprehensions
A list comprehension consists of brackets containing an expression followed by a ~for~ clause, then zero or more ~for~ or ~if~ clauses. Say we want to create a list of squared numbers, the typical way of doing so is using a for loop:
#+BEGIN_SRC python
squares = []
for x in range(5):
    squares.append(x**2)
#+END_SRC
Instead of using for loops to create a list, thus creating (or overwriting) a ~x~ that still exists after the loop, we can instead build a list inplace:
#+BEGIN_SRC python
squares[x**2 for x in range(5)]
#+END_SRC
We can apply a function on list in the same way:
#+BEGIN_SRC python
nums = [-10, -5, -3, 0, 4, -4, 1, 11, 23, 556, 5]
nums_pos = [abs(x) for x in nums]
#+END_SRC
A complex example would be to nest two list comprehensions to transpose a matrix:
#+BEGIN_SRC python :results output
mat = [[1,2,3],
       [4,5,6],
       [7,8,9],]
mat_transposed = [[row[i] for row in mat] for i in range(len(mat[0]))]
print(mat_transposed)
#+END_SRC

#+RESULTS:
: [[1, 4, 7], [2, 5, 8], [3, 6, 9]]

